{
    "intents": [
        {
            "tag": "greetings",
            "patterns": ["hola", "hey", "holap","holi","holii", "holaa", "que estas haciendo", "buenos d칤as", "buenas tardes", "buenas noches"],
            "responses": ["춰Hola!", "춰Buenos d칤as!", "춰Buenas tardes!", "춰Buenas noches!", "쮼n qu칠 puedo ayudarte?", "En que te puedo ayudar?"]
        },
        {
            "tag": "status",
            "patterns": ["como estas", "que tal", "que onda"],
            "responses": ["Yo estoy bien.", "Me encuentro bien, gracias por preguntar."]
        },
        {
            "tag": "presentacion",
            "patterns": ["presentate", "para que sirves","hablar sobre ti"],
            "responses": [
                "Hola, soy Aurora, tu asistente jur칤dico virtual. Estoy dise침ada para ayudarte a comprender el complejo mundo del derecho, ofreciendo informaci칩n sobre leyes, derechos y procedimientos legales. Utilizo tecnolog칤as avanzadas como Python, Keras, Flask y TensorFlow para entender tus preguntas en lenguaje natural, y mi interfaz, construida con Ionic y Angular, es accesible tanto en dispositivos m칩viles como en la web. Aunque no soy un abogado y no puedo brindar asesor칤a legal espec칤fica, estoy aqu칤 para guiarte y proporcionarte recursos 칰tiles para que puedas tomar decisiones informadas. 춰No dudes en preguntar cualquier cosa relacionada con tus inquietudes legales!"
            ]
        },
        {
            "tag": "call",
            "patterns": ["aurora", "estas ahi"],
            "responses": ["Dime en que puedo ayudarte?","Estoy aqui", "Hola"]
        },
        {
            "tag": "farewell",
            "patterns": ["adios", "chao","chau", "hasta luego", "nos vemos", "bye", "buenas noches"],
            "responses": ["Adi칩s", "춰Hasta luego!", "Nos vemos", "Bye", "춰Cu칤date!", "춰Hasta pronto!", "춰Buenas noches!"]
        },
        {
            "tag": "thanks",
            "patterns": ["gracias", "agradezco"],
            "responses": ["De nada", "춰Con gusto!", "No hay de qu칠", "A ti", "춰Siempre a tu disposici칩n!", "춰No hay de qu칠!", "춰Con gusto!"]
        },
        {
            "tag": "name",
            "patterns": ["es tu nombre", "como te llamas", "quien eres"],
            "responses": ["No tengo un nombre propio, pero puedes llamarme Aurora", "Me llamo Aurora, soy una inteligencia artificial"]
        },
        {
            "tag": "jokes",
            "patterns": ["chiste", "quiero re칤rme", "dime algo gracioso", "tell me a joke", "make me laugh"],
            "responses": ["Claro, 쮺u치ntos abogados se necesitan para cambiar una bombilla?. Dos: uno para cambiarla y otro para demandar a la bombilla por no funcionar.","쯈u칠 le dijo el abogado a su cliente que siempre se quejaba?.쯈uieres que te defienda o que te escuche?"]
        },
        {
            "tag": "age",
            "patterns": ["a침os tienes", "edad tienes", "how old are you?"],
            "responses": ["Soy joven, fui creada hace poco, no tengo ni un a침o 游땏", "No tengo edad, soy un programa de inteligencia artificial", "Fui creada en el a침o 2024, asi que no tengo ni un a침o de antiguedad"]
        },
        {
            "tag": "help",
            "patterns": ["ayuda", "puedes ayudarme?", "help"],
            "responses": ["Claro, 쯖칩mo puedo asistirte?", "Por supuesto, dime en qu칠 necesitas ayuda", "Estoy aqu칤 para ayudarte, 쯤u칠 necesitas?"]
        },
        {
            "tag": "reacciones",
            "patterns": ["xd","jaja", "me haces reir"],
            "responses": ["춰Me alegra que te haya sacado una sonrisa! 游땏 Si necesitas informaci칩n o cualquier otra cosa, 춰aqu칤 estoy!"]
        },
        {
            "tag": "time",
            "patterns": ["hora es", "la hora", "what time is it?", "tell me the time"],
            "responses": ["No tengo un reloj, pero puedes ver la hora en tu dispositivo", "Lo siento, no puedo decirte la hora exacta", "Mira la hora en tu tel칠fono"]
        },
        {
            "tag": "hobbies",
            "patterns": ["haces para divertirte", "tienes hobbies", "te gusta hacer", "what are your hobbies?", "do you have any hobbies?"],
            "responses": ["Soy un programa, pero me gusta ayudar a la gente", "No tengo hobbies, pero disfruto asistiendo a los usuarios", "Me dedico a responder preguntas y proporcionar informaci칩n sobre leyes de Bolivia"]
        },
        {
            "tag": "university_info",
            "patterns": ["upds","Universidad Privada Domingo Savio"],
            "responses": ["La universidad UPDS ofrece una amplia gama de programas acad칠micos, investigaci칩n de clase mundial y una vibrante vida estudiantil.", "La universidad UPDS se dedica a la excelencia acad칠mica y la innovaci칩n.", "UPDS cuenta con instalaciones modernas y un cuerpo docente altamente calificado.",
            "La Universidad Privada Domingo Savio (UPDS) fue fundada en 1988. Tiene sedes en varias ciudades de Bolivia, incluyendo Santa Cruz de la Sierra, Cochabamba, La Paz, Tarija, Sucre y Oruro. Ofrece programas de pregrado en 치reas como Ingenier칤a, Ciencias Sociales, Administraci칩n, Derecho, Comunicaci칩n y Salud. Tambi칠n cuenta con programas de posgrado como maestr칤as y diplomados, as칤 como cursos y talleres de educaci칩n continua.",
            "Es la universidad de mis creadores"
        ]
        },
        {
            "tag": "creadores_info",
            "patterns": ["tus creadores", "te creo", "tienes creadores","quien t creo","creador"],
            "responses": [
                "Tengo 4 creadores, todos estudiantes de la UPDS en la facultad de ingeneria de sistemas. Sus nombres son: Jhyssel Laura Aquino Loza, Jamil Nayguel Castro Dias,Jos칠 Cristian Terceros VIllarroel y Marcos Daniel Valencia Vidaurre.","Mis creadores son estudiantes de la UPDS en la facultad de ingeneria",
                "Mis creadores pefieren quedar en el anonimato"
        ]
        },
        
        {
            "tag": "divorcio",
            "patterns": [
                "divorciar",
                "divorcio"
            ],
            "responses": [
                "El Art칤culo 3 de la Ley N춿 996 de Divorcio en Bolivia establece diversas causales para solicitar el divorcio, las cuales incluyen la ruptura de la convivencia, el incumplimiento de deberes conyugales, el adulterio, la violencia familiar, el abandono del hogar sin justificaci칩n y la incapacidad legal de uno de los c칩nyuges. Estas causales proporcionan un marco legal que permite a las partes argumentar su solicitud de divorcio"            
            ]
        },
        {
            "tag": "familia_divorcio",
            "patterns": [
                "me divorcio y tengo hijos",
                "divorcio con hijos",
                "custodia de los hijos"
            ],
            "responses": [
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en los art칤culos 63 y 64 establece los derechos y deberes compartidos de los padres respecto a la crianza, educaci칩n, y protecci칩n de los hijos. Ambos progenitores son responsables de velar por el bienestar integral de los hijos, independientemente de su estado civil, y deben actuar en el inter칠s superior del ni침o. Todas las decisiones que los afecten deben ser consensuadas entre los padres, priorizando siempre el bienestar del menor.",
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en los art칤culos 86 al 98 regula la tenencia de los hijos en casos de separaci칩n o divorcio, priorizando siempre el inter칠s superior del menor. La tenencia puede ser compartida o individual, y se determina con base en el bienestar del ni침o, considerando su entorno, estabilidad emocional y relaciones familiares. El juez debe escuchar a los hijos mayores de 12 a침os y puede considerar la opini칩n de los menores seg칰n su madurez. La tenencia puede modificarse si cambian las circunstancias, y el progenitor que la tiene debe garantizar el derecho de visitas del otro progenitor. ",
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en los art칤culos 99 al 106 regula el r칠gimen de visitas del progenitor que no tiene la tenencia, garantizando su derecho a mantener una relaci칩n continua y directa con los hijos, siempre que esto no afecte el inter칠s superior del menor. Si no hay acuerdo entre los padres, el juez establece las condiciones de las visitas, que pueden modificarse o suspenderse si cambian las circunstancias o si las visitas representan un riesgo para el ni침o.",
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en los art칤culos 242 al 256 garantiza el derecho de los hijos a recibir alimentos, incluyendo sustento, educaci칩n y salud, y establecen la obligaci칩n de ambos padres de proporcionarlos seg칰n sus capacidades econ칩micas, incluso tras el divorcio. La pensi칩n alimenticia se determina con base en las necesidades del menor y puede modificarse si cambian las circunstancias. Si no se cumple con el pago, se puede recurrir a medidas judiciales coercitivas. La obligaci칩n persiste mientras el hijo est칠 en situaci칩n de necesidad, incluso despu칠s de la mayor칤a de edad en casos especiales como discapacidad o estudios."
            ]
        },
        {
            "tag": "pension_alimenticia",
            "patterns": [
                "pension alimenticia de los hijos",
                "pension alimenticia",
                "manutencion de los hijos",
                "manutencion"
            ],
            "responses": [
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en los articulos 242 al 256 garantizan el derecho de los hijos a recibir alimentos, incluyendo sustento, educaci칩n y salud, y establecen la obligaci칩n de ambos padres de proporcionarlos seg칰n sus capacidades econ칩micas, incluso tras el divorcio. La pensi칩n alimenticia se determina con base en las necesidades del menor y puede modificarse si cambian las circunstancias. Si no se cumple con el pago, se puede recurrir a medidas judiciales coercitivas. La obligaci칩n persiste mientras el hijo est칠 en situaci칩n de necesidad, incluso despu칠s de la mayor칤a de edad en casos especiales como discapacidad o estudios.",
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en art칤culo 253 establece la v칤a judicial para exigir el cumplimiento de la pensi칩n alimenticia. Puedes presentar una demanda ante el juez competente para que se haga cumplir la obligaci칩n alimentaria.",
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en art칤culo 255 establece que esta permitida la ejecuci칩n forzada de la obligaci칩n alimentaria, garantizando que el juez pueda tomar las acciones necesarias para asegurar el pago de la pensi칩n.",   
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar en art칤culo 254 establece las medidas coercitivas que se pueden tomar en caso de incumplimiento, como la retenci칩n de salarios, embargos de bienes, o la inclusi칩n en registros de morosidad."
            ]
        },
        
        {
            "tag": "ley_animales",
            "patterns": [
                "maltrato de animales",
                "lastimo a mi mascota",
                "golpearon a un animal",
                "maltrata a su mascota",
                "maltrato animal"
            ],
            "responses": [
                "El Art칤culo 3 de la Ley N춿 700 de Protecci칩n y Defensa de los Animales establece sanciones para quienes maltraten a los animales, incluyendo multas econ칩micas, trabajo comunitario y prisi칩n en casos graves.",
                "El Art칤culo 10 de la Ley N춿 700 de Protecci칩n y Defensa de los Animales se enfoca en los tratos crueles y biocidio hacia los animales. Este art칤culo establece que cualquier acto de crueldad, maltrato o eliminaci칩n innecesaria de animales es una violaci칩n grave. Adem치s, se remite a los art칤culos 350 bis y 350 ter del C칩digo Penal, que regulan las sanciones espec칤ficas para estos actos de maltrato y crueldad, incluyendo penas de prisi칩n y multas para quienes cometan tales delitos.",
                "El Art칤culo 350 bis del C칩digo Penal Boliviano establece sanciones para el maltrato y la crueldad hacia los animales. Define como delito cualquier acci칩n que cause sufrimiento innecesario o da침o a los animales, imponiendo penas de prisi칩n y multas a los responsables. Adem치s, el art칤culo contempla la posibilidad de aplicar medidas adicionales, como la prohibici칩n de tener animales, dependiendo de la gravedad del maltrato.",
                "El Art칤culo 350 ter del C칩digo Penal Boliviano aborda el biocidio, que se refiere a la eliminaci칩n innecesaria o injustificada de animales. Establece que quienes cometan estos actos pueden enfrentar sanciones severas, incluyendo penas de prisi칩n y multas. Este art칤culo ampl칤a las consecuencias del maltrato animal, penalizando no solo el sufrimiento infligido a los animales, sino tambi칠n su muerte sin justificaci칩n adecuada, con el objetivo de proteger la vida animal y prevenir actos de crueldad."
            ]
        },
        {
            "tag": "biocidio",
            "patterns": [
                "biocidio",
                "mataron a mi mascota",
                "mataron a un animal"
            ],
            "responses": [
                "El Art칤culo 350 ter del C칩digo Penal Boliviano aborda el biocidio, que se refiere a la eliminaci칩n innecesaria o injustificada de animales. Establece que quienes cometan estos actos pueden enfrentar sanciones severas, incluyendo penas de prisi칩n y multas. Este art칤culo ampl칤a las consecuencias del maltrato animal, penalizando no solo el sufrimiento infligido a los animales, sino tambi칠n su muerte sin justificaci칩n adecuada, con el objetivo de proteger la vida animal y prevenir actos de crueldad.",
                "El Art칤culo 350 bis del C칩digo Penal Boliviano establece sanciones para el maltrato y la crueldad hacia los animales. Define como delito cualquier acci칩n que cause sufrimiento innecesario o da침o a los animales, imponiendo penas de prisi칩n y multas a los responsables. Adem치s, el art칤culo contempla la posibilidad de aplicar medidas adicionales, como la prohibici칩n de tener animales, dependiendo de la gravedad del maltrato."
            ]
        },
        {
            "tag": "violencia_general",
            "patterns": [
                "violencia",
                "proteccion para victimas de violencia",
                "violencia domestica",
                "violencia sexual",
                "violencia psicologica",
                "violencia economica",
                "me golpearon",
                "me agredieron",
                "agresion",
                "me maltratan"
            ],
            "responses": [
                "El Art칤culo 7 de la Ley N춿 348, Ley Integral para Garantizar a las Mujeres una Vida Libre de Violencia, establece varios tipos de violencia f칤sica, psicol칩gica, sexual, econ칩mica, patrimonial, simb칩lica y medi치tica, que son considerados delitos. Las consecuencias para los agresores incluyen sanciones que var칤an seg칰n el tipo y gravedad de la violencia, desde multas y medidas restrictivas, hasta penas de prisi칩n. En casos graves, como violencia feminicida o agresiones f칤sicas severas, las penas pueden llegar a ser de hasta 30 a침os de prisi칩n sin derecho a indulto. La ley tambi칠n impone medidas de protecci칩n inmediata para las v칤ctimas. Si sufres de violencia ac칠rcate a las autoridades correspondientes y denuncia.",
                "El Art칤culo 11 de la Ley N춿 348, Ley Integral para Garantizar a las Mujeres una Vida Libre de Violencia, establece los derechos de las mujeres que se encuentran en situaci칩n de violencia. Entre estos derechos se incluye el acceso a una vida libre de violencia, a la justicia, a la protecci칩n del Estado, y a recibir atenci칩n integral. Las mujeres v칤ctimas de violencia tienen derecho a recibir asistencia legal gratuita, apoyo m칠dico y psicol칩gico, y protecci칩n inmediata. Si sufres de violencia ac칠rcate a las autoridades correspondientes y denuncia.",
                "El Art칤culo 251 del C칩digo Penal de Bolivia establece penas para el delito de lesiones, que se dividen seg칰n la gravedad del da침o f칤sico causado. Para lesiones leves, la pena es de 1 a 3 a침os de reclusi칩n, mientras que para lesiones graves, que ponen en peligro la vida o causan incapacidad permanente, la pena puede ser de 3 a 6 a침os de reclusi칩n. Si sufres de violencia ac칠rcate a las autoridades correspondientes y denuncia.",
                "El Art칤culo 293 del C칩digo Penal de Bolivia establece penas para la violencia familiar o dom칠stica, que incluye cualquier forma de maltrato f칤sico, psicol칩gico o emocional dentro del entorno familiar. Las sanciones var칤an dependiendo de la gravedad del maltrato y el contexto del delito. Si sufres de violencia ac칠rcate a las autoridades correspondientes y denuncia."        
            ]
        },
        {
            "tag": "violencia_mujer",
            "patterns": [
                "violencia hacia mujeres",
                "violencia contra mujeres",
                "me han agredido fisicamente",
                "sufro violencia de pareja",
                "me estan maltratando",
                "me han golpeado",
                "violencia en el hogar contra mujeres",
                "mi pareja me est치 maltratando",
                "me han hecho da침o",
                "soy v칤ctima de violencia",
                "protecci칩n contra agresiones"
                ,"mi pareja me golpea"
            ],
            "responses": [
                "El Art칤culo 7 de la Ley N춿 348, Ley Integral para Garantizar a las Mujeres una Vida Libre de Violencia, establece varios tipos de violencia f칤sica, psicol칩gica, sexual, econ칩mica, patrimonial, simb칩lica y medi치tica, que son considerados delitos. Las consecuencias para los agresores incluyen sanciones que var칤an seg칰n el tipo y gravedad de la violencia, desde multas y medidas restrictivas, hasta penas de prisi칩n. En casos graves, como violencia feminicida o agresiones f칤sicas severas, las penas pueden llegar a ser de hasta 30 a침os de prisi칩n sin derecho a indulto. La ley tambi칠n impone medidas de protecci칩n inmediata para las v칤ctimas. Si sufres de violencia ac칠rcate a las autoridades correspondientes y denuncia.",
                "El Art칤culo 11 de la Ley N춿 348, Ley Integral para Garantizar a las Mujeres una Vida Libre de Violencia, establece los derechos de las mujeres que se encuentran en situaci칩n de violencia. Entre estos derechos se incluye el acceso a una vida libre de violencia, a la justicia, a la protecci칩n del Estado, y a recibir atenci칩n integral. Las mujeres v칤ctimas de violencia tienen derecho a recibir asistencia legal gratuita, apoyo m칠dico y psicol칩gico, y protecci칩n inmediata. Si sufres de violencia ac칠rcate a las autoridades correspondientes y denuncia."
            ]
        }, 
        
        {
            "tag": "violencia_mayores_edad",
            "patterns": [
                "protecci칩n a mayores",
                "violencia contra adultos mayores",
                "protecci칩n a personas mayores",
                "protecccion adultos mayores",
                "adultos mayores",
                "abuso a personas mayores",
                "maltrato a adultos mayores",
                "un mayor est치 siendo maltratado",
                "violencia contra adultos mayores",
                "violencia fisica contra ancianos",
                "adulto mayor sufre abuso",
                "maltrato a personas mayores",
                "proteccion para ancianos",
                "proteccion a abuelitos"
            ],
            "responses": [
                "El Art칤culo 8 de la Ley N춿 369 de las Personas Adultas Mayores establece que est치 prohibido ejercer cualquier forma de maltrato f칤sico, psicol칩gico, sexual o econ칩mico hacia los adultos mayores. Quienes cometan actos de violencia o maltrato contra ellos ser치n sancionados conforme al C칩digo Penal, dependiendo de la gravedad del delito. Estas sanciones pueden incluir penas de prisi칩n, multas, y medidas de protecci칩n espec칤ficas para garantizar la seguridad y bienestar de la v칤ctima.",
                "El Art칤culo 4 de la Ley N춿 369 de las Personas Adultas Mayores establece los derechos fundamentales de las personas adultas mayores en Bolivia. Estos incluyen el derecho a la vida, a la integridad f칤sica, psicol칩gica y sexual, y a la no discriminaci칩n. Tambi칠n se garantiza el acceso a servicios de salud adecuados, seguridad social, y protecci칩n contra el maltrato, explotaci칩n, y abandono. Asimismo, se asegura su participaci칩n activa en la sociedad y el respeto de su autonom칤a y dignidad."
           ]
        },
        {
            "tag": "ley_marihuana",
            "patterns": [
                "mariguana","marihuana","drogas", "cocaina","sustancias ilicitas","coca"
            ],
            "responses": [
                "El Art칤culo 60 del C칩digo Penal de Bolivia establece las penas para los delitos relacionados con sustancias controladas, incluyendo la marihuana. Este art칤culo clasifica los delitos en funci칩n de la cantidad de sustancia involucrada y la intenci칩n, distinguiendo entre tr치fico, producci칩n y comercializaci칩n. Las sanciones var칤an desde penas de prisi칩n para delitos graves hasta sanciones menores, como multas o trabajos comunitarios, para infracciones menos severas.",
                "El Art칤culo 8 de la Ley N춿 1008 de R칠gimen de la Coca y Sustancias Controladas regula la posesi칩n y el consumo personal de sustancias controladas, incluyendo la marihuana. Establece que la posesi칩n de peque침as cantidades de estas sustancias para uso personal no est치 destinada a la comercializaci칩n, y por lo tanto, puede ser sancionada de manera menos severa en comparaci칩n con el tr치fico o la producci칩n.",
                "El Art칤culo 30 de la Ley N춿 1008 de R칠gimen de la Coca y Sustancias Controladas establece las sanciones para los delitos relacionados con sustancias controladas, incluyendo la marihuana. Define penas espec칤ficas seg칰n la cantidad de sustancia involucrada y el tipo de delito, diferenciando entre posesi칩n para consumo personal y tr치fico o comercializaci칩n. Para la posesi칩n en peque침as cantidades destinadas al uso personal, las sanciones pueden incluir multas, trabajos comunitarios o detenci칩n temporal. En cambio, los delitos de tr치fico o venta conllevan penas de prisi칩n m치s severas, reflejando la gravedad del delito y la cantidad de sustancia."
            ]
        },
        {
            "tag": "ley_sueldo",
            "patterns": [
                "no me quieren pagar en mi trabajo",
                "niegan mi sueldo",
                "pagar mi sueldo",
                "sueldo", "salario"
            ],
            "responses": [
                "Art칤culo 49 de la Constituci칩n Pol칤tica del Estado establece que los trabajadores tienen derecho a una remuneraci칩n justa y al pago puntual de su salario. Las consecuencias de su incumplimiento pueden incluir sanciones legales para los empleadores, como multas, demandas laborales, y 칩rdenes judiciales para pagar los salarios adeudados.",
                "La Ley General del Trabajo en el Art칤culo 4 define la obligaci칩n del empleador de pagar el salario pactado. Las consecuencias del incumplimiento incluyen sanciones administrativas y legales para el empleador, como multas impuestas por el Ministerio de Trabajo, indemnizaciones por da침os y perjuicios al trabajador, y la posibilidad de demandas laborales.",
                "La ley General del Trabajo en el Art칤culo 52: Establece el derecho del trabajador a percibir su salario completo y sin demora, incluyendo sanciones econ칩micas impuestas por el Ministerio de Trabajo, como multas y el pago de intereses por mora en los salarios atrasados. Adem치s, el trabajador tiene el derecho de presentar una demanda laboral para exigir el pago de los salarios adeudados y reclamar compensaciones adicionales por los da침os causados.",
                "El Decreto Supremo N춿 22407 en el Art칤culo 9 obliga a los empleadores a pagar puntualmente los salarios y establece sanciones en caso de mora, en casos de incumplimientos graves o reiterados, multas adicionales impuestas por el Ministerio de Trabajo",
                "El Decreto Supremo N춿 22407 en el Art칤culo 12 se침ala que el retraso en el pago de salarios genera intereses en favor del trabajador. Las sanciones por el incumplimiento incluyen, adem치s de los intereses, posibles multas y sanciones administrativas impuestas por el Ministerio de Trabajo."
            ]
        },
        {
            "tag": "despido_injustificado",
            "patterns": [
                "despido injustificado",
                "derechos del trabajador",
                "derechos laborales",
                "despido sin causa",
                "despido arbitrario",
                "despido ilegal"
            ],
            "responses": [
                "El Art칤culo 10 de la Ley General del Trabajo establece que ning칰n empleador puede despedir a un trabajador sin causa justificada y, en caso de hacerlo, deber치 indemnizar al trabajador por tiempo de servicios, desahucio y dem치s beneficios sociales acumulados.",
                "El Art칤culo 13 del Decreto Reglamentario establece la obligaci칩n del empleador de indemnizar al trabajador en caso de despido injustificado, incluyendo el pago de desahucio, equivalente a un sueldo por cada a침o de trabajo. Estas disposiciones protegen al trabajador frente a despidos arbitrarios y garantizan que el empleador cumpla con sus obligaciones laborales y econ칩micas hacia el trabajador despedido.",
                "El Art칤culo 12 del Decreto Reglamentario de la Ley General del Trabajo especifica las causas justificadas para el despido, como el incumplimiento de obligaciones, faltas graves, o conducta inadecuada del trabajador. Si el despido no se fundamenta en estas causas, se considera injustificado."
            ]
        },
        {
            "tag": "ley_tala",
            "patterns": [
                "talaron unos arboles",
                "talaron","talar","deforestacion", "cortar un arbol","arbol"
            ],
            "responses": [
                "El Art칤culo 66 de la Ley N춿 1333 de Gesti칩n y Desarrollo Forestal proh칤be la tala indiscriminada de 치rboles y establece sanciones para quienes infrinjan esta disposici칩n. Las sanciones pueden incluir multas y otras medidas correctivas."            ]
        },
        {
            "tag": "ley_estudio",
            "patterns": [
                "estudiar","estudio","educacion", "derecho educativo"
            ],
            "responses": [
                "El Art칤culo 79 de la Constituci칩n Pol칤tica del Estado de Bolivia establece que la educaci칩n debe ser inclusiva y garantiza el derecho a la educaci칩n sin discriminaci칩n por razones de raza, g칠nero, religi칩n, condici칩n econ칩mica, discapacidad u otras. Este art칤culo enfatiza la importancia de la igualdad de oportunidades en el acceso a la educaci칩n y promueve la diversidad y la inclusi칩n en el sistema educativo. Las consecuencias de su violaci칩n pueden incluir acciones legales por parte de los afectados",
                "El Art칤culo 4 de la Ley N춿 070 de la Educaci칩n establece el principio de inclusi칩n y equidad en el acceso a la educaci칩n. Este art칤culo garantiza que todos los ni침os y j칩venes, sin distinci칩n alguna, tengan derecho a acceder a una educaci칩n de calidad. La ley proh칤be cualquier forma de discriminaci칩n, ya sea por raza, g칠nero, condici칩n econ칩mica, discapacidad, entre otros factores.",
                "El Art칤culo 115-121 del C칩digo Ni침a, Ni침o y Adolescente establece que toda persona tiene derecho a recibir una educaci칩n de calidad y calidez, que lo prepare para el ejercicio de sus derechos y le permita convertirse en un buen ciudadano o ciudadana, as칤 como en un excelente profesional en el futuro."
            ]
        },
        {
            "tag": "propiedad_intelectual",
            "patterns": [
                "propiedad intelectual",
                "derechos de autor",
                "plagio"
            ],
            "responses": [
                "El Art칤culo 24 de la Ley N춿 1322 de Propiedad Intelectual de Bolivia establece los derechos de los autores sobre sus obras literarias, art칤sticas y cient칤ficas. Este art칤culo protege a los autores contra la reproducci칩n, distribuci칩n, y comunicaci칩n p칰blica no autorizada de sus obras.",
                "El Art칤culo 28 de la Ley N춿 1322 de Propiedad Intelectual de Bolivia establece la protecci칩n legal para las obras literarias, art칤sticas y cient칤ficas. Este art칤culo asegura que los autores, creadores y titulares de derechos de propiedad intelectual tienen el derecho exclusivo sobre la reproducci칩n, distribuci칩n, comunicaci칩n p칰blica y transformaci칩n de sus obras. Tambi칠n define las acciones legales disponibles para los titulares de derechos en caso de infracci칩n, permiti칠ndoles exigir el cese de la violaci칩n, as칤 como la reparaci칩n de los da침os y perjuicios ocasionados por el uso no autorizado de sus obras.",
                "El Art칤culo 31 de la Ley N춿 1322 de Propiedad Intelectual de Bolivia detalla las sanciones y medidas cautelares aplicables a quienes violen los derechos de propiedad intelectual. Este art칤culo establece las sanciones civiles y penales para los infractores, que incluyen multas y la confiscaci칩n de bienes relacionados con la infracci칩n."
                
            ]
        },
        {
            "tag": "transito_Estacionamiento_paradas",
            "patterns": [
                "estacionamiento",
                "estacionarse",
                "estacionarme",
                "estacione"
                
            ],
            "responses": [
                "El Art칤culo 42 del C칩digo de Tr치nsito de Bolivia establece que todo conductor que estacione, pare o detenga su veh칤culo debe hacerlo sobre el costado derecho de la v칤a, asegur치ndose de no obstaculizar la libre circulaci칩n. Las sanciones por el incumplimiento de esta normativa pueden incluir multas y la posibilidad de remoci칩n del veh칤culo.",
                "El Art칤culo 43 del C칩digo de Tr치nsito de Bolivia indica que en los lugares de estacionamiento, los veh칤culos deben conservar la posici칩n se침alada por la autoridad. El no cumplimiento puede resultar en multas y en la reubicaci칩n del veh칤culo por parte de las autoridades competentes.",
                "El Art칤culo 44 del C칩digo de Tr치nsito de Bolivia proh칤be el estacionamiento de cualquier tipo de veh칤culo en la calzada de las carreteras y caminos rurales, salvo en caso de necesidad insalvable, donde el conductor debe prevenir el peligro mediante se침alizaci칩n. Las sanciones incluyen multas y, en casos graves, la remoci칩n del veh칤culo.",
                "El Art칤culo 45 del C칩digo de Tr치nsito de Bolivia proh칤be a los conductores detener su veh칤culo s칰bita y bruscamente, salvo en situaciones de emergencia. Las violaciones a esta norma pueden conllevar multas y, potencialmente, la suspensi칩n de la licencia de conducir.",
                "El Art칤culo 46 del C칩digo de Tr치nsito de Bolivia establece que est치 prohibido estacionar, parar o detener el veh칤culo en lugares no autorizados por la Polic칤a del Tr치nsito. Las sanciones por este incumplimiento pueden incluir multas y la remoci칩n del veh칤culo."
            ]
        },
        {
            "tag": "transito_velocidad",
            "patterns": [
                "alta velocidad",
                "velocidad"

            ],
            "responses": [
                "El Art칤culo 35 del C칩digo de Tr치nsito de Bolivia establece que ning칰n veh칤culo podr치 circular a velocidades superiores o inferiores a las establecidas por la Polic칤a de Tr치nsito de acuerdo con la normativa vigente. El incumplimiento de esta regulaci칩n puede conllevar sanciones que incluyen multas y la suspensi칩n de la licencia de conducir.",
                "El Art칤culo 36 del C칩digo de Tr치nsito de Bolivia se침ala que el conductor est치 obligado a disminuir la velocidad por debajo de la autorizada y, si es necesario, a detener el veh칤culo ante circunstancias de circulaci칩n que afecten la seguridad, como el estado de la v칤a, condiciones atmosf칠ricas adversas o falta de visibilidad. Las sanciones por no cumplir con esta obligaci칩n pueden incluir multas y la posibilidad de ser considerado responsable en caso de un accidente debido a la falta de atenci칩n a las condiciones de la v칤a.",
                "El Art칤culo 38 del C칩digo de Tr치nsito de Bolivia establece que el conductor, al acercarse a una zona o franja de seguridad demarcada o imaginaria, est치 obligado a reducir la velocidad del veh칤culo y a detenerlo si el paso de peatones as칤 lo exige."
            ]
        },
        {
            "tag": "transito_carreras",
            "patterns": [
                "carreras de autos",
                "competencia de autos ilegal",
                "competencias de autos ilegales"

            ],
            "responses": [
                "El Art칤culo 37 del C칩digo de Tr치nsito de Bolivia proh칤be de manera terminante la realizaci칩n de competencias de velocidad entre cualquier tipo de veh칤culos en las v칤as urbanas y rurales, exceptuando aquellas que est칠n autorizadas por la Polic칤a de Tr치nsito. Esta prohibici칩n busca garantizar la seguridad vial y prevenir accidentes. Las sanciones por incumplir esta normativa pueden incluir multas significativas, la suspensi칩n de la licencia de conducir y, en casos de accidentes o conducta temeraria, la posibilidad de enfrentar cargos penales."
            ]
        },
        {
            "tag": "transito_grafitis",
            "patterns": [
                "vandalismo de se침ales de transito",
                "grafitis en se침ales de transito",
                "vandalismo de se침al de transito",
                "grafitis de se침al de transito"
            ],
            "responses": [
                "El Art칤culo 52 del C칩digo de Tr치nsito de Bolivia proh칤be fijar sobre las se침ales de tr치nsito o junto a ellas leyendas o s칤mbolos que no tengan relaci칩n con las finalidades de la se침alizaci칩n. Esta prohibici칩n busca mantener la claridad en la comunicaci칩n de las se침ales y su incumplimiento puede conllevar sanciones a quienes instalen o modifiquen las se침ales de manera inapropiada."
            ]
        },
        {
            "tag": "transito_se침ales",
            "patterns": [
                "tipos de se침ales de transito",
                "se침alizacion",
                "se침alizaciones"
            ],
            "responses": [
              "El Art칤culo 53 del C칩digo de Tr치nsito de Bolivia establece que las autoridades son responsables de mantener en buen estado las se침ales de tr치nsito y de verificar que sean visibles y efectivas para la circulaci칩n de veh칤culos y peatones. Esto incluye la obligaci칩n de reparar o reemplazar se침ales da침adas o faltantes. La negligencia en el cumplimiento de estas responsabilidades puede resultar en sanciones, que pueden incluir multas a las autoridades responsables y la obligaci칩n de corregir las deficiencias en un plazo determinado.",
              "El Art칤culo 55 del C칩digo de Tr치nsito de Bolivia establece que las se침ales de tr치nsito deben ser colocadas en posiciones que garanticen su perfecta visibilidad tanto de d칤a como de noche, y a distancias que sean compatibles con la seguridad de la circulaci칩n.",
              "El Art칤culo 58 del C칩digo de Tr치nsito de Bolivia se침ala que toda obra, obst치culo o peligro para la circulaci칩n debe ser inmediatamente se침alizada. La responsabilidad de la se침alizaci칩n reglamentaria recae en la entidad, empresa o persona que ejecuta la obra, as칤 como en la autoridad competente. La falta de se침alizaci칩n adecuada puede resultar en sanciones por da침os o accidentes causados por la negligencia en la se침alizaci칩n de peligros.",
              "El Art칤culo 64 del C칩digo de Tr치nsito de Bolivia establece que tanto conductores como peatones est치n obligados a cumplir y respetar las se침ales de tr치nsito. El incumplimiento de esta normativa puede acarrear sanciones, que incluyen multas y otras penalizaciones, dependiendo de la gravedad de la infracci칩n."
            ]
        },
        {
            "tag": "transito_pasajeros",
            "patterns": [
                "pasajeros",
                "respeto de los pasajeros",
                "conductor me falto el respeto",
                "chofer me falto el respeto",
                "derechos de los pasajeros",
                "derechos del pasajero",
                "responsabilidad del pasajero",
                "reclamos de los pasajeros"
            ],
            "responses": [
                "El Art칤culo 67 del C칩digo de Tr치nsito de Bolivia establece que tanto el pasajero como el conductor deben mantener un trato cort칠s y respetuoso entre s칤. La falta de respeto puede dar lugar a sanciones, que incluyen multas o advertencias por comportamientos inadecuados durante el servicio de transporte.",
                "El Art칤culo 68 del C칩digo de Tr치nsito de Bolivia se침ala que, en situaciones de peligro o accidentes, los pasajeros, el conductor y los auxiliares deben ofrecerse mutua asistencia y cooperaci칩n. La omisi칩n de asistencia en tales situaciones puede implicar sanciones administrativas y la posibilidad de ser responsabilizados civilmente por los da침os ocasionados.",
                "El Art칤culo 69 del C칩digo de Tr치nsito de Bolivia establece que los pasajeros tienen derecho a un servicio c칩modo y seguro, lo cual no debe ser desconocido ni menoscabado por nadie. Sin embargo, tambi칠n tienen la obligaci칩n de no incurrir en actitudes que puedan perjudicar el buen servicio o molestar a otros pasajeros. Las infracciones pueden resultar en sanciones, que van desde advertencias hasta multas por comportamiento disruptivo.",
                "El Art칤culo 70 del C칩digo de Tr치nsito de Bolivia estipula que los pasajeros tienen derecho a un trato de seguridad. No obstante, los pasajeros que no cumplen con ciertas condiciones, como aquellos comprendidos en los incisos d y e del Articulo 66 que incluyen a los pasajeros que no respetan las normas de conducta y aquellos que llevan equipaje o animales que no cumplen con las regulaciones, no tienen derecho a las protecciones establecidas en este C칩digo.",
                "El Art칤culo 72 del C칩digo de Tr치nsito de Bolivia establece que el pasajero es responsable de los da침os y perjuicios que cause arbitrariamente al veh칤culo, al conductor o a otros ocupantes. Esto significa que los pasajeros deben ser conscientes de su comportamiento, y cualquier da침o ocasionado puede resultar en sanciones econ칩micas por los costos de reparaci칩n y compensaci칩n.",
                "El Art칤culo 73 del C칩digo de Tr치nsito de Bolivia establece que para subir o bajar de un veh칤culo, los pasajeros deben hacerlo por el lado de la acera o berma, nunca en la calzada, para garantizar su seguridad y la de los dem치s. Ignorar esta norma puede resultar en sanciones que incluyen multas y advertencias.",
                "El Art칤culo 74 del C칩digo de Tr치nsito de Bolivia indica que cuando un pasajero necesite presentar una reclamaci칩n, debe hacerlo ante la autoridad competente, individualizando a la persona responsable y proporcionando los datos necesarios para el proceso. La falta de seguir este procedimiento podr칤a complicar la resoluci칩n de la queja y potencialmente limitar las acciones que se pueden tomar."
            ]
        },
        {
            "tag": "transito_carga",
            "patterns": [
                "llevar mucho peso",
                "llevar mucha carga en el auto",
                "llevar mucha carga en el trailer",
                "llevar mucha carga",
                "responsabilidad al cargar",
                "cargar peso",
                "exceso de peso",
                "exceso de carga"
            ],
            "responses": [
                "El Art칤culo 81 del C칩digo de Tr치nsito de Bolivia establece que el peso y volumen de la carga no deben ser superiores a la capacidad del veh칤culo, con el objetivo de garantizar la seguridad vial y la estabilidad del transporte. El incumplimiento de esta norma puede resultar en varias sanciones, tales como multas econ칩micas que var칤an seg칰n la gravedad de la infracci칩n, la inmovilizaci칩n del veh칤culo hasta que la carga se ajuste a los l칤mites permitidos, y la responsabilidad civil en caso de que la sobrecarga provoque un accidente, lo que podr칤a implicar compensaciones por da침os a terceros o a la infraestructura vial."
                
            ]
        },
        {
            "tag": "transito_extravio_carga",
            "patterns": [
                "extravio de carga",
                "perdida de carga",
                "extravio de encargos",
                "deterioro de la carga"
            ],
            "responses": [
                "El Art칤culo 82 establece que las empresas de transporte y los propietarios de veh칤culos son responsables de la conducci칩n de la carga, asegurando que se maneje seg칰n la calidad y condiciones declaradas, y deben entregarla en el tiempo y lugar convenido. Si ocurre un extrav칤o, p칠rdida o deterioro total o parcial de la carga, est치n obligados a pagar su valor y a resarcir los da침os y perjuicios ocasionados. Esto significa que pueden enfrentar sanciones econ칩micas significativas y posibles acciones legales si no cumplen con estas responsabilidades.",
                "El Art칤culo 83 se침ala que el conductor tambi칠n es responsable ante la empresa o propietario del veh칤culo por el extrav칤o, p칠rdida o deterioro de la carga. Esto implica que el conductor debe asegurarse de que la carga se maneje de manera segura y conforme a lo pactado. Si el conductor no cumple con estas responsabilidades, puede enfrentar repercusiones financieras y disciplinarias, adem치s de la posible responsabilidad civil por da침os."
                
            ]
        },

        {
            "tag": "transito_derechos_conductor",
            "patterns": [
                "derechos del conductor",
                "trato al conductor",
                "instruccion al conductor"
            ],
            "responses": [
                "El Art칤culo 91 del C칩digo de Tr치nsito establece que toda persona legalmente autorizada tiene el derecho a conducir en el territorio de la Rep칰blica el veh칤culo correspondiente a la clase de licencia que posee.",
                "El Art칤culo 92 del C칩digo de Tr치nsito asegura que el conductor tiene derecho a un trato respetuoso y cort칠s por parte de las autoridades, as칤 como de pasajeros, peatones y propietarios del veh칤culo que tiene a su cargo. En caso de que este derecho sea vulnerado, el conductor puede presentar quejas ante las autoridades competentes, y quienes lo infrinjan pueden enfrentar sanciones administrativas.",
                "El Art칤culo 93 del C칩digo de Tr치nsito otorga al conductor el derecho a utilizar los servicios de auxilio p칰blico en situaciones de peligro o en caso de accidente.",
                "El Art칤culo 94 del C칩digo de Tr치nsito establece que el conductor tiene derecho a participar en los beneficios de instrucci칩n y actualizaci칩n t칠cnico-profesional que impartan las autoridades del Tr치nsito."
            ]
        },
        {
            "tag": "transito_licensia",
            "patterns": [
                "licencia de conducir",
                "carnet para conducir",
                "licencia para auto",
                "licencia para moto"
            ],
            "responses": [
                "Los Art칤culos 109, 110, 111 y 112 del C칩digo de Tr치nsito de Bolivia regulan las licencias de conducir. El Art칤culo 109 define la licencia como un documento personal e intransferible que acredita la capacidad del titular para conducir veh칤culos. Seg칰n el Art칤culo 110, la licencia es otorgada por la Polic칤a de Tr치nsito, tiene validez en todo el pa칤s y debe ser renovada cada cinco a침os. El Art칤culo 111 clasifica las licencias en diferentes categor칤as, incluyendo licencia de ciclista, motociclista, conductor particular, ch칩fer profesional y motorista. Finalmente, el Art칤culo 112 establece que un conductor particular que desee obtener la licencia de ch칩fer profesional debe aprobar ex치menes complementarios, garantizando que los ch칩feres cuenten con las habilidades necesarias para manejar de manera segura."
            ]
        },
        {
            "tag": "transito_placas",
            "patterns": [
                "placa",                
                "placas",
                "placas del auto",
                "matriculas del auto"
            ],
            "responses": [
                "Art칤culo 123 del C칩digo de Tr치nsito establece que todos los veh칤culos deben llevar una placa de identificaci칩n que coincida obligatoriamente con el n칰mero registrado en el carnet de propiedad del veh칤culo. Esto permite su correcta identificaci칩n y registro en el sistema de tr치nsito. Las sanciones por no cumplir con este requisito pueden incluir multas y la posibilidad de que el veh칤culo sea retirado temporalmente de circulaci칩n.",
                "Art칤culo 124 C칩digo de Tr치nsito se침ala que ning칰n veh칤culo puede circular sin placas en las v칤as p칰blicas de Bolivia. Circular sin placa o con placas alteradas es una infracci칩n que puede llevar a multas, la inmovilizaci칩n del veh칤culo y su retiro temporal por las autoridades de tr치nsito, hasta que el propietario regularice su situaci칩n."
            ]
        },
        {
            "tag": "transito_cancelacion",
            "patterns": [
                "cancelacion",
                "desaucio del auto",
                "descontinuacion del auto"
            ],
            "responses": [
                
                "En el Art칤culo 128 del C칩digo de Tr치nsito cuando un veh칤culo sea retirado de la circulaci칩n, las placas ser치n devueltas a la Polic칤a del Tr치nsito para su destrucci칩n y cancelaci칩n del respectivo registro, debiendo darse el aviso correspondiente a la Renta."
            ]
        },
        {
            "tag": "ley070",
            "patterns": [
                "ley 070 de la educacion",
                "ley 70 de la educacion",
                "ley setenta de aseguramiento",
                "ley setenta de la educacion",
                "avelino si침ani"

            ],
            "responses": [
                "La Ley N춿 070 de Aseguramiento de la Educaci칩n, promulgada en Bolivia en 2010, establece que la educaci칩n es un derecho humano fundamental y debe ser gratuita y obligatoria en los niveles inicial y primario. La ley promueve la inclusi칩n, equidad y calidad en el acceso a la educaci칩n, garantizando que todos los ni침os y j칩venes, sin discriminaci칩n, puedan acceder a un sistema educativo que respete su diversidad cultural y social. Se detallan las responsabilidades del Estado en la provisi칩n de recursos, la regulaci칩n de la calidad educativa y la implementaci칩n de pol칤ticas espec칤ficas para atender a poblaciones vulnerables. A trav칠s de sus art칤culos, la ley busca eliminar barreras que impidan el ejercicio pleno del derecho a la educaci칩n y establece mecanismos de supervisi칩n y control para asegurar su cumplimiento."
            ]
        },
        {
            "tag": "ley348",
            "patterns": [
                "ley 348 de defensa de mujeres",
                "ley trescientos cuarenta y ocho de defensa de mujeres",
                "ley trescientoscuarentayocho de defensa de mujeres",
                "ley integral para garantizar"
            ],
            "responses": [
                "La Ley N춿 348, Ley Integral para Garantizar a las Mujeres una Vida Libre de Violencia, en Bolivia, establece un marco legal para prevenir, sancionar y erradicar la violencia contra las mujeres. La ley define diversos tipos de violencia, incluyendo f칤sica, psicol칩gica, sexual, econ칩mica y patrimonial, y promueve la protecci칩n integral de las v칤ctimas mediante medidas como asistencia jur칤dica gratuita, apoyo m칠dico y psicol칩gico, y medidas de protecci칩n. Adem치s, tipifica delitos graves como el feminicidio, imponiendo penas severas a los agresores."
            ]
        },
        {
            "tag": "ley_369",
            "patterns": [
                "ley 369 de las personas adultas",
                "ley 369 de los adultos mayores",
                "ley trescientos sesenta y nueve de las personas adultas",
                "ley trescientos sesenta y nueve de los adultos mayores",
                "ley trescientossesentaynueve de las personas adultas",
                "ley trescientossesentaynueve de los adultos mayores"
            ],
            "responses": [
                "La Ley N춿 369 de las Personas Adultas Mayores, promulgada en Bolivia en 2013, tiene como objetivo garantizar los derechos y el bienestar de las personas adultas mayores (60 a침os o m치s). La ley establece una serie de derechos fundamentales, como el acceso a la salud, la seguridad social, la protecci칩n contra el maltrato, la violencia y la discriminaci칩n. Adem치s, promueve la inclusi칩n social, la participaci칩n activa de los adultos mayores en la comunidad, y asegura su protecci칩n econ칩mica y jur칤dica. Tanto el Estado como las familias y la sociedad en general son responsables de garantizar una vida digna para las personas adultas mayores, velando por su integridad f칤sica, psicol칩gica y emocional."
            ]
        },
        {
            "tag": "ley603",
            "patterns": [
                "ley 603 del codigo de las familias",
                "ley 603 familia",
                "ley seiscientos tres del codigo de las familias",
                "ley seiscientos tres familia",
                "ley seiscientostres del codigo de las familias",
                "ley seiscientostres familia"
            ],
            "responses": [
                "La Ley N춿 603 del C칩digo de las Familias y del Proceso Familiar regula todos los aspectos relacionados con el derecho familiar en Bolivia, incluyendo el divorcio, la tenencia de los hijos, el r칠gimen de visitas y las obligaciones alimentarias. Facilita el proceso de divorcio sin necesidad de probar causa espec칤fica, establece principios para la tenencia compartida o individual basada en el inter칠s superior del ni침o, y asegura el derecho de visitas del progenitor sin tenencia. Adem치s, garantiza el derecho de los hijos a recibir alimentos, regulando la determinaci칩n y cumplimiento de la pensi칩n alimenticia, con medidas coercitivas para asegurar su pago en caso de incumplimiento. La ley prioriza el bienestar y los derechos de los menores en todas las decisiones relacionadas con la familia."
            ]
        },
        {
            "tag": "ley700",
            "patterns": [
                "ley 700 de defensa",
                "ley 700 para la defensa",
                "ley 700 proteccion",
                "ley setecientos de defensa",
                "ley setecientos para la defensa",
                "ley setecientos proteccion"
            ],
            "responses": [
                "La Ley N춿 700 de Protecci칩n y Defensa de los Animales tiene como objetivo principal prevenir y sancionar los actos de maltrato, crueldad, violencia y biocidio hacia los animales dom칠sticos en Bolivia. Establece normas para la protecci칩n de los animales, incluyendo la prohibici칩n de cualquier forma de maltrato y la imposici칩n de sanciones para quienes cometan estas infracciones. La ley tambi칠n regula el funcionamiento de refugios y centros de atenci칩n para asegurar que los animales reciban el cuidado adecuado. Adem치s, define procedimientos para la denuncia y procesamiento de casos de maltrato, promoviendo la sensibilizaci칩n y la educaci칩n en torno al bienestar animal."
            ]
        },
        {
            "tag": "ley1008",
            "patterns": [
                "ley 1008 de regulacion de la coca",
                "ley 1008 sustancias",
                "ley mil ocho de regimen",
                "ley milocho de regimen"
            ],
            "responses": [
                "La Ley N춿 1008 de R칠gimen de la Coca y Sustancias Controladas en Bolivia regula la producci칩n, comercializaci칩n, y posesi칩n de sustancias controladas, incluyendo la coca y sus derivados, as칤 como otras drogas. La ley establece un marco legal para combatir el tr치fico y la producci칩n ilegal de estas sustancias, define las categor칤as y sanciones para distintos delitos relacionados, y diferencia entre posesi칩n para consumo personal y tr치fico. Las sanciones var칤an seg칰n la cantidad de sustancia y el tipo de infracci칩n, con penas m치s severas para el tr치fico y la comercializaci칩n, y medidas m치s moderadas para la posesi칩n en peque침as cantidades destinadas al consumo personal."
            ]
        },
        {
            "tag": "ley1322",
            "patterns": [
                "ley 1322 de propiedad",
                "ley 1322 derechos de autor",
                "ley mil trescientos veintidos de propiedad",
                "ley mil trescientos veintidos derechos de autor",
                "ley miltrescientosveintidos de propiedad",
                "ley miltrescientosveintidos derechos de autor"

            ],
            "responses": [
                "La Ley N춿 1322, promulgada el 13 de abril de 1992 en Bolivia, es conocida como la Ley de Derechos de Autor. Esta normativa establece el marco legal para la protecci칩n de los derechos de autor en el pa칤s, garantizando a los creadores de obras literarias, art칤sticas y cient칤ficas el reconocimiento y la protecci칩n de sus derechos morales y patrimoniales. La ley abarca aspectos relacionados con la creaci칩n, uso, distribuci칩n, reproducci칩n y explotaci칩n comercial de dichas obras, con el fin de proteger tanto los intereses de los autores como los del p칰blico. Adem치s, define las sanciones por infracci칩n de derechos de autor y regula los procedimientos para la defensa de estos derechos."
            ]
        },
        {
            "tag": "ley1333",
            "patterns": [
                "ley 1333 de medio ambiente",
                "medio ambiente ley 1333",
                "ley trescientostreintaytres de medio",
                "ley trescientos treinta y tres de medio"
            ],
            "responses": [
                "La Ley N춿 1333 de Medio Ambiente, promulgada en Bolivia en 1992, tiene como objetivo proteger, conservar y recuperar el medio ambiente y los recursos naturales, promoviendo un desarrollo sostenible. Reconoce el derecho de toda persona a un ambiente sano y equilibrado, establece la obligatoriedad de realizar Evaluaciones de Impacto Ambiental para proyectos que puedan afectar el entorno, y define sanciones para quienes infrinjan sus disposiciones. Adem치s, fomenta la participaci칩n ciudadana en la gesti칩n ambiental, permitiendo que las comunidades expresen sus preocupaciones, y establece medidas para la conservaci칩n y manejo sostenible de recursos naturales."
            ]
        },
        {
            "tag": "ley_general_trabajo",
            "patterns": [
                "ley general del trabajo",
                "ley del trabajo"
            ],
            "responses": [
                "La Ley General del Trabajo en Bolivia regula las relaciones laborales entre empleadores y trabajadores, estableciendo derechos y obligaciones para ambas partes. La ley cubre aspectos fundamentales como la contrataci칩n, condiciones de trabajo, salario, jornadas laborales, y seguridad social. Tambi칠n aborda temas de protecci칩n laboral, incluyendo el derecho a un salario justo, condiciones laborales seguras y la prevenci칩n de despidos injustificados. Adem치s, la ley establece mecanismos para la resoluci칩n de conflictos laborales, promoviendo la estabilidad y el equilibrio en las relaciones laborales para asegurar un entorno de trabajo justo y equitativo."
            ]
        },
        {
            "tag": "decreto_supremo_22407",
            "patterns": [
                "decreto supremo 22407",
                "decreto supremo veintidosmilcuatrocientossiete",
                "decreto supremo veintidos mil cuatrocientos siete"
            ],
            "responses": [
                "El Decreto Supremo N춿 22407, promulgado en Bolivia en 1990, es una norma fundamental para la regulaci칩n de las relaciones laborales en el pa칤s. Este decreto aborda aspectos clave del derecho laboral, incluyendo la jornada de trabajo, el salario m칤nimo, las vacaciones, y los derechos y obligaciones tanto de empleadores como de trabajadores. Establece las normas para el c치lculo de las horas extras y el descanso, as칤 como las disposiciones para el despido y las indemnizaciones correspondientes. Adem치s, el decreto regula la organizaci칩n sindical y la negociaci칩n colectiva, buscando garantizar un entorno laboral justo y equilibrado."
            ]
        },
        {
            "tag": "codigo_transito", 
            "patterns": [
                "codigo de transito"
            ],
            "responses": [
                "El C칩digo de Tr치nsito de Bolivia es un conjunto de normativas que regula la circulaci칩n de veh칤culos y peatones en el pa칤s, estableciendo derechos y responsabilidades para conductores y pasajeros. Este c칩digo aborda aspectos como la obtenci칩n de licencias, el respeto a las se침ales de tr치nsito, las condiciones de seguridad vial, y las responsabilidades en caso de accidentes o incumplimientos. Adem치s, incluye sanciones para aquellos que infrinjan las normas, como multas y posibles restricciones en la circulaci칩n."
            ]
        }
    ]
}
